# Домашняя работа

## Урок 3. Списки и словари

Задача 16:
Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

*Пример:*

5
    1 2 3 4 5
    3
    -> 1

```python
import random

print("Задача 16")
X = int(input("Введите искомое число: "))
N = int(input("Введите количество элементов в массиве: "))
list_mass = []
count_num = 0
for i in range(N):
    list_mass.append(random.randint(1, 10))
    
for j in list_mass:
    if j == X:
        count_num +=1
print(f'Массив = {list_mass}\nИскомое число = {X}\nКоличество элементов числа -> {count_num}')
```

Задача 18:
Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

*Пример:*

5
    1 2 3 4 5
    6
    -> 5

```python
import random

print("Задача 18") 

N = abs(int(input('Введите количество элементов списка А: ')))

list_mass = []
for j in range(N):
    list_mass.append(random.randint(1, 10))

X = int(input('Введите число X, с которым необходимо сравнивать элементы списка: '))
min_num = abs(X - list_mass[0])
index = 0
for i in range(N):
    count = abs(X - list_mass[i])
    if count < min_num:
        min_num = count
        index = i
print(f'Массив - {list_mass}\nЧисло {list_mass[index]} в списке A наиболее близко по величине к числу {X}, их разница составляет {abs(X - list_mass[index])}')
```

*Задача 20:
В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
В случае с английским алфавитом очки распределяются так:
A, E, I, O, U, L, N, S, T, R – 1 очко;
D, G – 2 очка;
B, C, M, P – 3 очка;
F, H, V, W, Y – 4 очка;
K – 5 очков;
J, X – 8 очков;
Q, Z – 10 очков.
А русские буквы оцениваются так:
А, В, Е, И, Н, О, Р, С, Т – 1 очко;
Д, К, Л, М, П, У – 2 очка;
Б, Г, Ё, Ь, Я – 3 очка;
Й, Ы – 4 очка;
Ж, З, Х, Ц, Ч – 5 очков;
Ш, Э, Ю – 8 очков;
Ф, Щ, Ъ – 10 очков.
Напишите программу, которая вычисляет стоимость введенного пользователем слова.
Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

*Пример:*

ноутбук
    12

```python
print("Задача 20")

text = input("Введите слово: ")

en = 'qwertyuiopasdfghjklzxcvbnm'


symbol_en = {
    1 : 'AEIOULNSTR',
    2 : 'DG',
    3 : 'BCMP',
    4 : 'FHVWY',
    5 : 'K',
    8 : 'JX',
    10 : 'QZ'
}

symbol_ru = {
    1 : 'АВЕИНОРСТ',
    2 : 'ДКЛМПУ',
    3 : 'БГЁЬЯ',
    4 : 'ЙЫ',
    5 : 'ЖЗХЦЧ',
    8 : 'ШЭЮ',
    10 : 'ФШЪ'
}

summa = 0

if text[0].lower() in en:
    for i in text:
        for key, value in symbol_en.items():
            if i.upper() in value:
                summa += key
else:
    for i in text:
        for key, value in symbol_ru.items():
            if i.upper() in value:
                summa += key
print(f'Цена слова "{text}" = {summa}')
```
