# Задача 2: Найдите сумму цифр трехзначного числа. 

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

def task():
    print("Задание 2")
    num = int(input("Введите число: "))
    print(f'Сумма цифр числа {num} -> {(num // 100) + ((num // 10) % 10) + (num % 10)} ({num // 100} + {(num // 10) % 10} + {num % 10})')
 