# Домашняя работа

## Урок 5. Рекурсия и алгоритмы

Задача 26:  
Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

*Пример:*

A = 3; B = 5 -> 243 (3⁵)
    A = 2; B = 3 -> 8

```python
print("Задача 26")

def exponent(a, b):
    if b == 0:
        return 1
    return a*exponent(a, b - 1)


A_num = int(input("Введите число А: "))
B_num = int(input("Введите число B: "))

print(f'A = {A_num}; B = {B_num} -> {exponent(A_num, B_num)} <- ({A_num} в степени {B_num})')
```

Задача 28:
Напишите рекурсивную функцию sum(a, b),
возвращающую сумму двух целых неотрицательных чисел.
Из всех арифметических операций допускаются только +1 и -1.
Также нельзя использовать циклы.

*Пример:*

2 2
    4

```python
print("Задание 28")
def summ(a, b):
    if b == 0:
        return a
    return summ(a + 1, b - 1)
A = int(input("Введите А: "))
B = int(input("Введите Б: "))
print(f'Сумма двух чисел А + Б = {summ(A, B)}')
```
